#Область ПрограммныйИнтерфейс 
// Извлекает данные из json с помощью ПрочитатьJSON. Если файл не json, то будет выведено предупреждение.
// Параметры:
//  Файл - Строка - путь до json файла.
//  МассивДат - Массив из Строка - поля в json с датами.
// Возвращаемое значение:
// Произвольный
Функция ИзвлечьДанныеИзJSON(Файл, МассивДат) Экспорт
	Чтение = Новый ЧтениеJSON;
	Чтение.ОткрытьФайл(Файл);
	Данные = ПрочитатьJSON(Чтение, Истина, МассивДат, ФорматДатыJSON.ISO);
	Чтение.Закрыть();
	Возврат Данные;
КонецФункции
#КонецОбласти