#Область ПрограммныйИнтерфейс
// Получить случайное число.
// 
// Параметры:
//  От - Число - Левая граница включительно
//  До - Число - Правая граница включительно
// 
// Возвращаемое значение:
//  Число - случайное число
Функция ПолучитьСлучайноеЧисло(От, До) Экспорт
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	Возврат ГСЧ.СлучайноеЧисло(От, До)
КонецФункции

// Получить случайный элемент из массива.
// 
// Параметры:
//  Масс - Массив из ЛюбаяСсылка - массив элементов.
// 
// Возвращаемое значение:
//  - ЛюбаяСсылка - ссылка на случайный элемент в массиве.
//  
Функция ПолучитьСлучайныйЭлементИзМассива(Знач Масс) Экспорт
	//TODO: Добавить обработку массива с одним элементом или нет?
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	СлучайныйИндекс = ГСЧ.СлучайноеЧисло(0, Масс.Количество() - 1);
	Возврат Масс[СлучайныйИндекс];
КонецФункции
#КонецОбласти