#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если (Не ПроверитьМаску(Объект.Номер)) Тогда
		Отказ = Истина;
		ДиалогКлиент.Сообщ("Формат номера должен быть: +7 (999) 999 99-99", "Объект.Номер");
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьПолеОператор(Команда)
	Если ПроверитьМаску(Объект.Номер) Тогда
		КодОператора = Число(Сред(Объект.Номер, 5, 3));
		НайденныйОператор = ОпределитьОператора(КодОператора);
		Если НайденныйОператор <> Неопределено Тогда
			Объект.Оператор = НайденныйОператор;
		Иначе
			ДиалогКлиент.Сообщ(СтрШаблон("Оператор с кодом %1 не найден!", КодОператора), "Объект.Оператор");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Функция определения оператора согласно данным Справочник.ОператорыМобильнойСвязи
// 
// Параметры:
//  КодОператора - Число - Код оператора мобильной связи.
// 
// Возвращаемое значение:
//  СправочникСсылка.ОператорыМобильнойСвязи - если оператор найден
//  Неопределено - если оператор не найден
&НаСервере
Функция ОпределитьОператора(КодОператора)
	ТекстЗапроса = "
				   |ВЫБРАТЬ Ссылка 
				   |ИЗ Справочник.ОператорыМобильнойСвязи.ТелефонныеКоды 
				   |ГДЕ КодОператора=&КодОператора";
	Выборка = ПростыеЗапросы.ПолучитьВыборку(ТекстЗапроса, "КодОператора", КодОператора);
	Если Выборка.Следующий() > 0 Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПроверитьМаску(Номер)
	//Для +7 (999) 999 99-99
	МаскаТелефона = "\+[7]\s[(]\d{3}[)]\s\d{3}\s\d{2}[-]\d{2}";
	Возврат СтрПодобнаПоРегулярномуВыражению(Номер, МаскаТелефона, Ложь, Ложь);
КонецФункции

#КонецОбласти