#Область ОписаниеПеременных
&НаКлиенте
Перем ПольскаяНотация, СтекОпераций, Приоритет;
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВычислитьВыражение(Команда)
	//Массив чисел, операции и скобок в виде польской нотации. 
	ПольскаяНотация = Новый Массив;
	//Стек, в который будут идти скобки и операции с большим приоритетом.
	СтекОпераций = Новый Массив;
	Приоритет = Новый Соответствие;
	Приоритет.Вставить("*", 1);
	Приоритет.Вставить("/", 1);
	Приоритет.Вставить("+", 0);
	Приоритет.Вставить("-", 0);
	Выраж = Выражение;
	Ответ = "";
	Сообщение = Новый СообщениеПользователю;
	Попытка
		Если ПроверитьНаБуквы(Выраж) Тогда
			СоставитьПольскуюНотацию(Выраж);
			Ответ = РассчитатьПоПольскойНотации();
		Иначе
			ОчиститьСообщения();
			Сообщение.Текст = "Выражение поддерживает лишь целые положительные числа, пробел и операции +-*/";
			Сообщение.Сообщить();
		КонецЕсли;
	Исключение
		Сообщение.Текст = "Некорректное выражение!";
		Сообщение.Сообщить();
	КонецПопытки;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Если в выражении есть постронние символы, то вернет ЛОЖЬ.
// 
// Параметры:
//  Выраж - Строка - значение из строки выражения.
// 
// Возвращаемое значение:
//  Булево - ИСТИНА, если в выражении нет посторонних символов.
&НаКлиенте
Функция ПроверитьНаБуквы(Выраж)
	Если Не ПустаяСтрока(Выраж) Тогда
		ДопустимыеСимволы = "1234567890+-*/() ";
		Для ИндексСимв = 1 По СтрДлина(Выраж) Цикл
			Симв = Сред(Выраж, ИндексСимв, 1);
			Если СтрНайти(ДопустимыеСимволы, Симв) = 0 Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

// Извлечет все символы начиная с ИндексНачала, если они являются цифрами, склеит их и переведет в число.
// 
// Параметры:
//  Выраж - Строка - значение из строки выражения.
//  ИндексНачала - Число - Индекс в строке выражения, с которого начинается число.
// 
// Возвращаемое значение:
//  Число - число, начиная с индекса до следующего числового символв или конца строки.
&НаКлиенте
Функция ИзьятьЧисло(Выраж, ИндексНачала)
	Числа = "01234567890";
	Результат = "";
	Пока ИндексНачала <= СтрДлина(Выраж) Цикл
		Символ = Сред(Выраж, ИндексНачала, 1);
		СимволЭтоЧисло =  СтрНайти(Числа, Символ) > 0;
		Если СимволЭтоЧисло Тогда
			Результат = Результат + Символ;
			ИндексНачала = ИндексНачала + 1;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Число(Результат);
КонецФункции 

// Определит чем является символ из выражения: скобками, операцией,пробелом или числом
// если символ это цифра, то извлекает всё число и помещает в нотацию.
// если левая скобка, то заносит ее в стек
// если операция, то смотрит есть ли в стеке что-то, НЕ является ли вершина стека левой скобкой
// и выше ли приориотет у операции из вершины по сравнению с текущей операцией
// пока условия выполнены, то переносит операции из стека в нотацию
// если правая скобка, то переносит все значения из стека в нотацию,
// пока стек не опустеет или не появится левая скобка и удаляет вершину стека (левую скобку)
// в конце заносит все операции из стека в нотацию.
// 
// Параметры:
//  Выраж - Строка -  значение из строки выражения.
&НаКлиенте
Процедура СоставитьПольскуюНотацию(Выраж)
	Для ИндексСимв = 1 По СтрДлина(Выраж) Цикл
		Симв = Сред(Выраж, ИндексСимв, 1);
		СимволЭтоЛеваяСкобка = СтрСравнить(Симв, "(") = 0;
		СимволЭтоПраваяСкобка = СтрСравнить(Симв, ")") = 0;
		СимволЭтоПробел = СтрСравнить(Симв, " ") = 0;
		СимволЭтоОперация = Приоритет.Получить(Симв) <> Неопределено;
		СимволЭтоЧисло = Не СимволЭтоОперация И Не СимволЭтоЛеваяСкобка И Не СимволЭтоПраваяСкобка И Не СимволЭтоПробел;

		Если СимволЭтоЧисло Тогда
			ПольскаяНотация.Добавить(ИзьятьЧисло(Выраж, ИндексСимв));
			ИндексСимв = ИндексСимв - 1;
		ИначеЕсли СимволЭтоЛеваяСкобка Тогда
			СтекОпераций.Вставить(0, Симв);
		ИначеЕсли СимволЭтоОперация Тогда
			Пока (СтекОпераций.Количество() > 0 И Не СтрСравнить(СтекОпераций[0], "(") = 0 И Приоритет.Получить(
				СтекОпераций[0]) >= Приоритет.Получить(Симв)) Цикл
				ПольскаяНотация.Добавить(СтекОпераций[0]);
				СтекОпераций.Удалить(0);
			КонецЦикла;
			СтекОпераций.Вставить(0, Симв);
		ИначеЕсли СимволЭтоПраваяСкобка Тогда
			Пока (СтекОпераций.Количество() > 0 И Не СтрСравнить(СтекОпераций[0], "(") = 0) Цикл
				ПольскаяНотация.Добавить(СтекОпераций[0]);
				СтекОпераций.Удалить(0);
			КонецЦикла;
			СтекОпераций.Удалить(0);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Операция Из СтекОпераций Цикл
		ПольскаяНотация.Добавить(Операция);
	КонецЦикла;
КонецПроцедуры

// В новый стек загружаются числа и результаты операций из нотации
// если символ из нотации это операция, то берет первые два числа из стека и проводит операцию
// результат операции добавляет а вершину стека
// вершина стека после прохождения нотации будет результатом.
// 
// Возвращаемое значение:
//  Число - результат вычисления в виде дисятичного числа.
&НаКлиенте
Функция РассчитатьПоПольскойНотации()
	Стек = Новый Массив;
	Для Каждого Элем Из ПольскаяНотация Цикл
		Если Приоритет.Получить(Элем) = Неопределено Тогда
			Стек.Вставить(0, Число(Элем));
		Иначе
			Число2 = Число(Стек[0]);
			Стек.Удалить(0);
			Число1 = Число(Стек[0]);
			Стек.Удалить(0);
			Если СтрСравнить(Элем, "*") = 0 Тогда
				Стек.Вставить(0, Число1 * Число2);
			ИначеЕсли СтрСравнить(Элем, "/") = 0 Тогда
				Стек.Вставить(0, Число1 / Число2);
			ИначеЕсли СтрСравнить(Элем, "+") = 0 Тогда
				Стек.Вставить(0, Число1 + Число2);
			ИначеЕсли СтрСравнить(Элем, "-") = 0 Тогда
				Стек.Вставить(0, Число1 - Число2);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Стек[0];
КонецФункции
#КонецОбласти