#Область ПрограммныйИнтерфейс
// Ищет соответствие или значение в JSON по пяти параметрам, составляя при этом иерархию поиска.
// Если последний определенный параметр это ключ json, то будет возращено не соответствие, а значение этого ключа согласно иерархии предыдущих параметров.
// Параметры:
//  Соотв - Соответствие из Неопределено - результат чтения JSON в виде соответствия.
//  Первый - Строка - название первого объекта json или ключа.
//  Второй - Строка - название второго объекта json или ключа.
//  Третий - Строка - название третьего объекта json или ключа.
//  Четвертый - Строка - название четвертого объекта json или ключа.
//  Пятый - Строка - название пятого объекта json или ключа.
//  ТолькоЗначения - Булево - отображать только значения, если результатом будет тип соответствие, структура или массивы, то результат будет неопределен, будет выведено сообщение об этом результате.
// Возвращаемое значение:
// Строка, Число, Дата, Булево, Массив, Соответствие, Неопределено - вернет тип данных, согласно пути.
Функция Поиск(Соотв, Первый, Второй = Неопределено, Третий = Неопределено, Четвертый = Неопределено,
	Пятый = Неопределено, ТолькоЗначения = Истина) Экспорт
	Все = Новый Массив;
	Все.Добавить(Первый);
	Все.Добавить(Второй);
	Все.Добавить(Третий);
	Все.Добавить(Четвертый);
	Все.Добавить(Пятый);
	Поиск = Новый Массив;
	Для Каждого Элем Из Все Цикл
		Если Элем <> Неопределено Тогда
			Поиск.Добавить(Элем);
		КонецЕсли;
	КонецЦикла;
	Возврат ПолучитьЗначение(Поиск, Соотв, ТолькоЗначения);
КонецФункции

// Ищет значение в JSON по пути, заданном в массиве.  Если последний элемент массива это ключ json, то будет возращено не соответствие, а значение этого ключа согласно иерархии в массиве.
// Если путь не соответствует json (один из объектов неопределен), то вернет Неопределено.
// Параметры:
//  МассивПути - Массив из Строка - каждый элемет в массиве объекта json.
//  Соотв - Соответствие из Неопределено - результат чтения JSON в виде соответствия.
//  ТолькоЗначения - Булево - отображать только значения, если результатом будет тип соответствие, структура или массивы, то результат будет неопределен, будет выведено сообщение об этом результате.
// Возвращаемое значение:
// Строка, Число, Дата, Булево, Массив, Соответствие, Неопределено - вернет тип данных, согласно пути.
Функция ПолучитьЗначение(МассивПути, Соотв, ТолькоЗначения = Истина) Экспорт
	Результат = Соотв;
	НазвПослКлюча = МассивПути[0];
	Пока МассивПути.Количество() <> 0 И ТипЗнч(Соотв) = Тип("Соответствие") И Результат <> Неопределено Цикл
		Результат = Результат.Получить(МассивПути[0]);
		НазвПослКлюча = МассивПути[0];
		МассивПути.Удалить(0);
	КонецЦикла;
	Если МассивПути.Количество() > 0 Тогда
		МассивПути.Очистить();
	КонецЕсли;
	Тип = ТипЗнч(Результат);
	Если ТолькоЗначения И (Тип = Тип("Соответствие") Или Тип = Тип("Массив") Или Тип = Тип("Структура")) Тогда
		ДиалогКлиент.Сообщ("Значение ключа[" + НазвПослКлюча + "] не найдено!");
		Возврат Неопределено;
	КонецЕсли;
	Возврат Результат;
КонецФункции
#КонецОбласти