#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ)
	Команда1 = Команды.Добавить("Команда1");
	Команда1.Действие = "УзнатьОператора";
	Кнопка1 = Элементы.Добавить("Кнопка1", Тип("КнопкаФормы"), ЭтотОбъект);
	Кнопка1.ИмяКоманды = "Команда1";
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УзнатьОператора()
	ТекущийНомер = ВернутьТекущийНомер();
	Сообщ = Новый СообщениеПользователю();
	Если ПроверитьМаску(ТекущийНомер) Тогда
		ЦифрыОператора = Число(Сред(ТекущийНомер, 5, 3));
		НайденныйОператор = "";
		Если (ЦифрыОператора >= 910 И ЦифрыОператора <= 919) Или (ЦифрыОператора >= 980 И ЦифрыОператора <= 989) Тогда
			НайденныйОператор = "МТС";
		Иначе
			Сообщ.Текст = "Оператор не определен";
			Сообщ.Сообщить();
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(НайденныйОператор) Тогда 
			ЗаписатьОператораВФорму(НайденныйОператор);
		КонецЕсли;
			
	Иначе
		Сообщ.Текст = "Формат номера должен быть: +7 (999) 999 99-99";
		Сообщ.Сообщить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьМаску(Номер)
	//Для +7 (999) 999 99-99
	МаскаТелефона = "\+[7]\s[(]\d{3}[)]\s\d{3}\s\d{2}[-]\d{2}";
	Возврат СтрПодобнаПоРегулярномуВыражению(Номер, МаскаТелефона, Ложь, Ложь);
КонецФункции

&НаСервере
Функция ВернутьТекущийНомер()
	Возврат РеквизитФормыВЗначение("Объект").Номер;
КонецФункции

&НаСервере
Процедура ЗаписатьОператораВФорму(НайденныйОператор)
	ОбъектНомеров = РеквизитФормыВЗначение("Объект");
	ОбъектНомеров.Оператор = НайденныйОператор;
	ЗначениеВРеквизитФормы(ОбъектНомеров, "Объект");
КонецПроцедуры
#КонецОбласти