#Область ПрограммныйИнтерфейс
// Получить выборку по тексту запроса.
// 
// Параметры:
//  ТекстЗапроса - Строка - запрос.
//  ИмяПарам - Строка - название параметра из текста запроса.
//  Парам - Произвольный - параметр запроса, на которое ссылкается имя.
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Получить выборку
Функция ПолучитьВыборку(ТекстЗапроса, ИмяПарам = Неопределено, Парам = Неопределено) Экспорт
	//TODO: можно добавить проверки и исключения.
	Запр = Новый Запрос(ТекстЗапроса);
	Если ИмяПарам <> Неопределено И Парам <> Неопределено Тогда
		Запр.УстановитьПараметр(ИмяПарам, Парам);
	КонецЕсли;
	Возврат Запр.Выполнить().Выбрать();
КонецФункции

// Помещает в массив данные из одной колонки выборки.
// 
// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса - выборка из запроса.
//  Колонка - Произвольный - имя колонки, должно соответствовать ВыборкаИзРезультатаЗапроса.ИмяПоля.
// 
// Возвращаемое значение:
//  Массив из Произвольный - вернет массив соответствующие типа из колонки.
Функция ВМассивПоКолонке(Выборка, Колонка) Экспорт
	//TODO: массив может быть фиксированным -> Выборка.Количество(), будет ли лучше?
	Масс = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Масс.Добавить(Колонка);
	КонецЦикла;
	Возврат Масс;
КонецФункции
#КонецОбласти