#Область ОбработчикиКомандФормы
// Позволяет выбрать файл json со структурой, ответа <a href="https://api-fns.ru/api_help#section_dannye">API ФНС</a>.
// Если файл  соответствует структуре, то произойдет автозаполнение полей формы по json.
// Если файл не соответствует структуре, то ничего не произойдет.
&НаКлиенте
Процедура ВыбратьФайл()
	ОчиститьПоля();
	ДиалогВыбораПапки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если ДиалогВыбораПапки.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораПапки.ПолноеИмяФайла;
		МассивИменДат = Новый Массив;
		МассивИменДат.Добавить("ДатаОГРН");
		МассивИменДат.Добавить("ДатаРег");
		МассивИменДат.Добавить("Дата");
		Данные = ОбработкаJSONВызовСервера.ИзвлечьДанныеИзJSON(ПутьКфайлу, МассивИменДат);
		Корень = Данные["items"];
		Если Корень <> Неопределено И ТипЗнч(Корень) = Тип("Массив") И Корень.Количество() > 0 Тогда
			Корень = Данные["items"][0];
			ЮЛ = Корень.Получить("ЮЛ");
			Если ЮЛ <> Неопределено Тогда
				Объект.ВидОрганизации = ПредопределенноеЗначение("Перечисление.ВидыОрганизаций.ЮрЛицо");
				Объект.ИНН = ОбработкаJSONКлиент.Поиск(ЮЛ, "ИНН");
				Объект.ОГРН = ОбработкаJSONКлиент.Поиск(ЮЛ, "ОГРН");
				Объект.Наименование = ОбработкаJSONКлиент.Поиск(ЮЛ, "НаимПолнЮЛ");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОчиститьПоля()
	Объект.ВидОрганизации = Неопределено;
	Объект.ИНН = "";
	Объект.ОГРН = "";
	Объект.Наименование = "";
КонецПроцедуры
#КонецОбласти